Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/libwrapper/metrology/wrp_em_adc.c
/******************************************************************************
* DISCLAIMER

* This software is supplied by Renesas Electronics Corporation and is only 
* intended for use with Renesas products. No other uses are authorized.

* This software is owned by Renesas Electronics Corporation and is protected under 
* all applicable laws, including copyright laws.

* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES 
* REGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, 
* INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
* PARTICULAR PURPOSE AND NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY 
* DISCLAIMED.

* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS 
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE 
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES 
* FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS 
* AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.

* Renesas reserves the right, without notice, to make changes to this 
* software and to discontinue the availability of this software.  
* By using this software, you agree to the additional terms and 
* conditions found by accessing the following link:
* http://www.renesas.com/disclaimer
******************************************************************************/
/* Copyright (C) 2011 Renesas Electronics Corporation. All rights reserved.  */
/****************************************************************************** 
* File Name    : wrp_em_adc.c
* Version      : 1.00
* Device(s)    : RL78/I1C
* Tool-Chain   : CubeSuite Version 1.5d
* H/W Platform : RL78/I1C Energy Meter Platform
* Description  : ADC Wrapper for RL78/I1C Platform
******************************************************************************
* History : DD.MM.YYYY Version Description
******************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
/* Driver */
#include "r_cg_macrodriver.h"
#include "r_cg_dsadc.h"

/* Wrapper */
#include "wrp_em_sw_config.h"               /* Wrapper Shared Configuration */
#include "wrp_em_adc.h"                     /* Wrapper ADC definitions */
#include "r_dscl_iirbiquad_i32_onestage.h"  /* Library 32bit IIRBiquad */
//#include "em_integrator.h"      /* Runge-Kutta Integrator definitions */
#include "rl78_sw_dc_correction.h"			/* Renesas DC Imunity detection library */

/* Middleware */
#include "em_type.h"
#include "em_core.h"

/* Application */
#include "platform.h"

/******************************************************************************
Typedef definitions
******************************************************************************/
typedef struct
{
    int16_t pos;        /* Position */
    uint16_t step;      /* Step */
    int32_t *p_value;   /* Array of signals */
} shift_circle_t;

/******************************************************************************
Macro definitions
******************************************************************************/
#define EM_ADC_CHANNEL_RESULT_REG_ADDR_VOLTAGE              (&(JOIN(DSADCR, EM_ADC_CURRENT_DRIVER_CHANNEL_OPTIMIZATION_VOLTAGE)))
#define EM_ADC_CHANNEL_RESULT_REG_ADDR_PHASE                (&(JOIN(DSADCR, EM_ADC_CURRENT_DRIVER_CHANNEL_OPTIMIZATION_PHASE)))
#define EM_ADC_CHANNEL_RESULT_REG_ADDR_NEUTRAL              (&(JOIN(DSADCR, EM_ADC_CURRENT_DRIVER_CHANNEL_OPTIMIZATION_NEUTRAL)))

#if (defined METER_WRAPPER_ADC_COPY_NEUTRAL_SAMPLE)
#define EM_ADC_DRIVER_READ_NEUTRAL() {\
    *((uint16_t *)&g_wrp_adc_samples.i2) = *((uint16_t *)EM_ADC_CHANNEL_RESULT_REG_ADDR_NEUTRAL); \
    *((uint8_t *)&g_wrp_adc_samples.i2 + 0x02) = *((uint8_t *)EM_ADC_CHANNEL_RESULT_REG_ADDR_NEUTRAL + 0x02); \
    *((int8_t *)&g_wrp_adc_samples.i2 + 0x03) = (*((int8_t *)EM_ADC_CHANNEL_RESULT_REG_ADDR_NEUTRAL + 0x02)) >> 7; \
}
#else
#define EM_ADC_DRIVER_READ_NEUTRAL() {;}
#endif

#define EM_ADC_DRIVER_READ_ALL()    {\
                                        /* Voltage channel */\
                                        *((uint16_t *)&g_wrp_adc_samples.v)         = *((uint16_t *)EM_ADC_CHANNEL_RESULT_REG_ADDR_VOLTAGE);\
                                        *((uint8_t *)&g_wrp_adc_samples.v + 0x02)   = *((uint8_t *)EM_ADC_CHANNEL_RESULT_REG_ADDR_VOLTAGE + 0x02);\
                                        *((int8_t *)&g_wrp_adc_samples.v + 0x03)    = (*((int8_t *)EM_ADC_CHANNEL_RESULT_REG_ADDR_VOLTAGE + 0x02)) >> 7;\
                                        /* Phase channel */\
                                        *((uint16_t *)&g_wrp_adc_samples.i1)        = *((uint16_t *)EM_ADC_CHANNEL_RESULT_REG_ADDR_PHASE);\
                                        *((uint8_t *)&g_wrp_adc_samples.i1 + 0x02)  = *((uint8_t *)EM_ADC_CHANNEL_RESULT_REG_ADDR_PHASE + 0x02);\
                                        *((int8_t *)&g_wrp_adc_samples.i1 + 0x03)   = (*((int8_t *)EM_ADC_CHANNEL_RESULT_REG_ADDR_PHASE + 0x02)) >> 7;\
                                        /* Neutral channel */\
                                        EM_ADC_DRIVER_READ_NEUTRAL();\
                                    }

/******************************************************************************
Imported global variables and functions (from other files)
******************************************************************************/

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/

/******************************************************************************
Private global variables and functions
******************************************************************************/

/* Variables */
#if (EM_ADC_DELAY_STEP_VOLTAGE_CHANNEL > 0)
int32_t         g_wrp_adc_voltage_value[EM_ADC_DELAY_STEP_VOLTAGE_CHANNEL+1];
shift_circle_t  g_wrp_adc_voltage_circle = 
{
    0,                                  /* Pos */
    EM_ADC_DELAY_STEP_VOLTAGE_CHANNEL,  /* Step */
    g_wrp_adc_voltage_value,            /* Array of signals */
};
#endif
#if (EM_ADC_DELAY_STEP_PHASE_CHANNEL > 0)
int32_t         g_wrp_adc_phase_value[EM_ADC_DELAY_STEP_PHASE_CHANNEL+1];
shift_circle_t  g_wrp_adc_phase_circle = 
{
    0,                                  /* Pos */
    EM_ADC_DELAY_STEP_PHASE_CHANNEL,    /* Step */
    g_wrp_adc_phase_value,              /* Array of signals */
};
#endif
#if (EM_ADC_DELAY_STEP_NEUTRAL_CHANNEL > 0)
int32_t         g_wrp_adc_neutral_value[EM_ADC_DELAY_STEP_NEUTRAL_CHANNEL+1];
shift_circle_t  g_wrp_adc_neutral_circle = 
{
    0,                                  /* Pos */
    EM_ADC_DELAY_STEP_NEUTRAL_CHANNEL,  /* Step */
    g_wrp_adc_neutral_value,            /* Array of signals */
};
#endif

/* Sub-functions */
static void EM_ADC_DoPhaseDelay(
    int32_t *signal,
    shift_circle_t *p_circle
);

/* Gain level */
static uint8_t  g_EM_ADC_GainPhaseCurrentLevel;     /* The current level of phase gain */
static uint8_t  g_EM_ADC_GainNeutralCurrentLevel;   /* The current level of neutral gain */

