Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/libwrapper/metrology/wrp_em_adc.c
/* Static I/F for this module */
/* Changing gain, apply gain value to the port pin */
static void EM_ADC_GainPhaseSet(void);              /* Set a suitable gain phase level to a port */
static void EM_ADC_GainNeutralSet(void);            /* Set a suitable gain neutral level to a port */

#ifdef __DEBUG
#define EM_MAX_SAMPLE_BUFFER        (390)
volatile uint16_t            g_sample_count = EM_MAX_SAMPLE_BUFFER;
volatile EM_SW_SAMP_TYPE     g_sample0[EM_MAX_SAMPLE_BUFFER];
volatile EM_SW_SAMP_TYPE     g_sample1[EM_MAX_SAMPLE_BUFFER];
volatile uint8_t             g_sample1_direction = 0;    /* I1 */
const uint16_t      g_sample_max_count = EM_MAX_SAMPLE_BUFFER;
#endif

#if (METER_ENABLE_DC_IMUNITY_DETECTION_ON_SAMPLE == 1)
volatile uint8_t g_dc_immunity_state= 0;
volatile int16_t g_dc_detected_count = 0;
#define DC_DETECTION_COUNT_THRESHOLD        (12000)       /* 256us per detection routine (in DSAD interrupt)
                                                           * Need 6s delay means ~24000 count. 
                                                           * But in normal signal condition, this count would start from negative, 
                                                           * So choosing half of neccessary count is enough
                                                           */
#endif

/* Sample storage of wrapper */
EM_SAMPLES g_wrp_adc_samples;
/* Not related to EM: debug call back entry to attach debug function: trace code,... */
/* Function to near for atomic set */
void (NEAR_FUNC * g_wrp_adc_basic_signal_ready_cb_and_return)(void) = NULL;
void (NEAR_FUNC * g_wrp_adc_signal_ready_cb_and_return)(void) = NULL;
/******************************************************************************
* Function Name    : static void EM_ADC_GainPhaseSet(void)
* Description      : Set a suitable gain phase level to a port
* Arguments        : None
* Functions Called : None
* Return Value     : None
******************************************************************************/
static void EM_ADC_GainPhaseSet(void)
{
    switch (g_EM_ADC_GainPhaseCurrentLevel)
    {
        case 0:     /* Set gain level 0 */
            R_DSADC_SetChannelGain(EM_ADC_DRIVER_CHANNEL_PHASE, EM_ADC_GAIN_PHASE_LEVEL0);
            break;
        case 1:     /* Set gain level 1 */
            R_DSADC_SetChannelGain(EM_ADC_DRIVER_CHANNEL_PHASE, EM_ADC_GAIN_PHASE_LEVEL1);
            break;
        default:
            break;
    };
}

/******************************************************************************
* Function Name    : static void EM_ADC_GainNeutralSet(void)
* Description      : Set a suitable gain neutral level to a port
* Arguments        : None
* Functions Called : None
* Return Value     : None
******************************************************************************/
static void EM_ADC_GainNeutralSet(void)
{
    switch (g_EM_ADC_GainNeutralCurrentLevel)
    {
        case 0:     /* Set gain level 0 */
            R_DSADC_SetChannelGain(EM_ADC_DRIVER_CHANNEL_NEUTRAL, EM_ADC_GAIN_NEUTRAL_LEVEL0);
            break;
        case 1:     /* Set gain level 1 */
            R_DSADC_SetChannelGain(EM_ADC_DRIVER_CHANNEL_NEUTRAL, EM_ADC_GAIN_NEUTRAL_LEVEL1);
            break;
        default:
            break;
    };
}

/******************************************************************************
* Function Name    : static void EM_ADC_DoPhaseDelay(
*                  :    int32_t *signal, 
*                  :    int32_t *p_circle
*                  : )
* Description      : Shift input signal as expected step
* Arguments        : *signal  : Signal income then outcome
*                  : *p_circle: Circle structure used to control the phase
* Functions Called : TBD
* Return Value     : None
******************************************************************************/
static void EM_ADC_DoPhaseDelay(
    int32_t *signal,
    shift_circle_t *p_circle
)
{
    int16_t push_pos;
    int16_t pop_pos;
    
    push_pos = p_circle->pos;
    if (push_pos <= 0)
    {
        pop_pos = p_circle->step;
    }
    else
    {
        pop_pos = push_pos - 1;
    }

    /* PUSH: Add the signal into the data circle at circlepos position */
    p_circle->p_value[push_pos] = *signal;

    /* POP: Get the signal from data circle from (pos + steps) position */
    *signal = p_circle->p_value[pop_pos];
    
    /* Scroll the circle, scroll left */
    push_pos--;
    if (push_pos == -1)
    {
        push_pos = p_circle->step;
    }

    p_circle->pos = push_pos;
}

/******************************************************************************
* Function Name    : static void EM_ADC_DoNoisyBitMasking(void)
* Description      : Do noisy bit masking for signals
* Functions Called : None
* Return Value     : None
******************************************************************************/
static void EM_ADC_DoNoisyBitMasking(void)
{
    int16_t v_mask;
    int16_t i1_mask;
    int16_t i2_mask;
    
    /************************************************************
    * Noisy bit masking
    *  - Find the signal mask
    *************************************************************/
    #ifdef EM_ENABLE_NOISY_BIT_MASKING
    /* Find the mask of V, I1, I2 for signal accumulation */
    v_mask      = (int16_t)(g_wrp_adc_samples.v       >> 16);
    i1_mask     = (int16_t)(g_wrp_adc_samples.i1      >> 16);
    #ifdef METER_WRAPPER_ADC_COPY_NEUTRAL_SAMPLE
    i2_mask     = (int16_t)(g_wrp_adc_samples.i2      >> 16);
    #endif /* METER_WRAPPER_ADC_COPY_NEUTRAL_SAMPLE */

    if (v_mask == 0x0000)
    {
        /* Mask off the noise, 4 low-bits */
        *((uint8_t *)&g_wrp_adc_samples.v) &= EM_MASK_OFF_NOISY_BITS_POSITIVE;
    }
    else if (v_mask == 0xffff)
    {
        /* Mask off the noise, 4 low-bits */
        *((uint8_t *)&g_wrp_adc_samples.v) |= EM_MASK_OFF_NOISY_BITS_NEGATIVE;
    }

    if (i1_mask == 0x0000)
    {
        /* Mask off the noise, 4 low-bits */
        *((uint8_t *)&g_wrp_adc_samples.i1) &= EM_MASK_OFF_NOISY_BITS_POSITIVE;
    }
    else if (i1_mask == 0xffff)
    {
        /* Mask off the noise, 4 low-bits */
        *((uint8_t *)&g_wrp_adc_samples.i1) |= EM_MASK_OFF_NOISY_BITS_NEGATIVE;
    }

