Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/libwrapper/metrology/wrp_em_adc.c
    #ifdef METER_WRAPPER_ADC_COPY_NEUTRAL_SAMPLE
    if (i2_mask == 0x0000)
    {
        /* Mask off the noise, 4 low-bits */
        *((uint8_t *)&g_wrp_adc_samples.i2) &= EM_MASK_OFF_NOISY_BITS_POSITIVE;
    }
    else if (i2_mask == 0xffff)
    {
        /* Mask off the noise, 4 low-bits */
        *((uint8_t *)&g_wrp_adc_samples.i2) |= EM_MASK_OFF_NOISY_BITS_NEGATIVE;
    }
    #endif /* METER_WRAPPER_ADC_COPY_NEUTRAL_SAMPLE */
    #endif /* EM_ENABLE_NOISY_BIT_MASKING */
}

/******************************************************************************
* Function Name    : void EM_ADC_Init(void)
* Description      : Set a suitable gain neutral level to a port
* Arguments        : None
* Functions Called : EM_ADC_DriverInit()
* Return Value     : None
******************************************************************************/
void EM_ADC_Init(void)
{
    /* Init ADC HW Module */
    EM_ADC_DriverInit();
}

/******************************************************************************
* Function Name    : void EM_ADC_Start(void)
* Description      : Start ADC sampling
* Arguments        : None
* Functions Called : EM_ADC_DriverStart()
* Return Value     : None
******************************************************************************/
void EM_ADC_Start(void)
{
    /* Initial DC_Imunit Libary and Reset data */
    #if (METER_ENABLE_DC_IMUNITY_DETECTION_ON_SAMPLE == 1)
    R_DC_Imunity_Init(&g_dc_imunity_config_default_4k_50Hz);
    R_DC_Imunity_Reset_Phase_1();
    #endif
    
    #ifdef METER_WRAPPER_ADC_COPY_FUNDAMENTAL_SAMPLE
    R_DSCL_IIRBiquad_i32i32_onestage_Reset();
    R_DSCL_IIRBiquad_i32i32_onestage_Reset2();
    /* Enable 1 current channel */
    //R_DSCL_IIRBiquad_i32i32_onestage_Reset3();
    #endif
    
    /* Start ADC HW Module */
    EM_ADC_DriverStart();
}

/******************************************************************************
* Function Name    : void EM_ADC_Stop(void)
* Description      : Stop ADC sampling
* Arguments        : None
* Functions Called : EM_ADC_DriverStop()
* Return Value     : None
******************************************************************************/
void EM_ADC_Stop(void)
{
    /* Stop ADC HW Module */
    EM_ADC_DriverStop();
}


/******************************************************************************
* Function Name    : void EM_ADC_InterruptCallback(void)
* Description      : ADC Interrupt callback processing
* Arguments        : None
* Functions Called : TBD
* Return Value     : None
******************************************************************************/
void EM_ADC_InterruptCallback(void)
{
    /* Read all dsad result to buffer */
    EM_ADC_DRIVER_READ_ALL();

    EM_ADC_DoNoisyBitMasking();
    
    /* Phase adjustment for each channel if enabled */
    #if (EM_ADC_DELAY_STEP_VOLTAGE_CHANNEL > 0)
    EM_ADC_DoPhaseDelay(
        &g_wrp_adc_samples.v,
        &g_wrp_adc_voltage_circle
    );
    #endif
    
    #if (EM_ADC_DELAY_STEP_PHASE_CHANNEL > 0)
    EM_ADC_DoPhaseDelay(
        &g_wrp_adc_samples.i1,
        &g_wrp_adc_phase_circle
    );
    #endif
    
    #if (EM_ADC_DELAY_STEP_NEUTRAL_CHANNEL > 0)
    EM_ADC_DoPhaseDelay(
        &g_wrp_adc_samples.i2,
        &g_wrp_adc_neutral_circle
    );
    #endif

    /* Call back and return for capturing processed basic signals on other application */
    {
        if (g_wrp_adc_basic_signal_ready_cb_and_return != NULL) 
        {
            g_wrp_adc_basic_signal_ready_cb_and_return();
            return;
        }
    }

    #ifdef METER_WRAPPER_ADC_COPY_FUNDAMENTAL_SAMPLE
    /* Filter the voltage signal for fundamental calculation, do when normal running only */
    R_DSCL_IIRBiquad_i32i32_onestage_c_nr(g_wrp_adc_samples.v, &g_wrp_adc_samples.v_fund);
    /* Filter the current signal for fundamental calculation, do when normal running only */
    /* Enable 1 current channel */
    R_DSCL_IIRBiquad_i32i32_onestage_c_nr2(g_wrp_adc_samples.i1, &g_wrp_adc_samples.i1_fund);
    //R_DSCL_IIRBiquad_i32i32_onestage_c_nr3(g_wrp_adc_samples.i2, &g_wrp_adc_samples.i2_fund);
    #endif

    /* Integrate the signal if using Rogowski coil */
    #if (METER_ENABLE_INTEGRATOR_ON_SAMPLE == 1)
    #ifndef __DEBUG
        g_datalog_sample_before_integrate_i1 = g_wrp_adc_samples.i1;
        g_datalog_sample_before_integrate_i2 = g_wrp_adc_samples.i2;
    #endif
    /* Integrate the signal from Rogowski coil, API will append later */
    g_wrp_adc_samples.i1 = EM_ADC_Integrator0(g_wrp_adc_samples.i1);
    g_wrp_adc_samples.i2 = EM_ADC_Integrator1(g_wrp_adc_samples.i2);
    #endif

    /* Call back and return for capturing processed full signal on other application */
    {
        if (g_wrp_adc_signal_ready_cb_and_return != NULL) 
        {
            g_wrp_adc_signal_ready_cb_and_return();
            return;
        }
    }

	#if (METER_ENABLE_DC_IMUNITY_DETECTION_ON_SAMPLE == 1)
	g_dc_immunity_state = R_DC_Imunity_Calc_Phase_1(g_wrp_adc_samples.i1);
	#endif
    
    /* Debug the signal */
    #ifdef __DEBUG
    #ifndef METER_ENABLE_MEASURE_CPU_LOAD
    if (g_sample_count < EM_MAX_SAMPLE_BUFFER)
    {
        g_sample0[g_sample_count] = g_wrp_adc_samples.v;
        if (g_sample1_direction == 0)
        {
            g_sample1[g_sample_count] = g_wrp_adc_samples.i1;
        }
        else if (g_sample1_direction == 1)
        {
            g_sample1[g_sample_count] = g_wrp_adc_samples.i2;
        }
        g_sample_count++;
    }
    #endif /* METER_ENABLE_MEASURE_CPU_LOAD */
    #endif /* __DEBUG */
    
    {
        {
            /* Normal processing */
            EM_ADC_IntervalProcessing(&g_wrp_adc_samples);
        }
    }
}

/******************************************************************************
* Function Name    : void EM_ADC_GainReset(EM_LINE line)
* Description      : Reset phase gain to lowest level
* Arguments        : None
* Functions Called : None
* Return Value     : None
******************************************************************************/
void EM_ADC_GainReset(EM_LINE line)
{
    switch (line)
    {
        case EM_LINE_PHASE:
            g_EM_ADC_GainPhaseCurrentLevel = 0;     /* Lowest */
            EM_ADC_GainPhaseSet();
            break;
        case EM_LINE_NEUTRAL:
            g_EM_ADC_GainNeutralCurrentLevel = 0;       /* Lowest */
            EM_ADC_GainNeutralSet();
            break;
        default:
            break;
    }
}

