Firmwarelead/Source_code_Full_Metering_DLMS_08_10_24_EEPROM_CMD_/01.Source/rl78i1c/libwrapper/metrology/wrp_em_adc.c
/******************************************************************************
* Function Name    : void EM_ADC_GainIncrease(EM_LINE line)
* Description      : Increase phase gain 1 level & set the gain level to port
* Arguments        : None
* Functions Called : EM_ADC_GainPhaseSet()
* Return Value     : None
******************************************************************************/
void EM_ADC_GainIncrease(EM_LINE line)
{
    switch (line)
    {
        case EM_LINE_PHASE:
            if (g_EM_ADC_GainPhaseCurrentLevel >= EM_GAIN_PHASE_NUM_LEVEL_MAX - 1)    /* Is highest gain? */
            {
                return; /* Do nothing */
            }
            else    /* Still exist higher gain */
            {
                g_EM_ADC_GainPhaseCurrentLevel++;   /* Increase level count */
                EM_ADC_GainPhaseSet();              /* Apply gain */
            }
            break;
        case EM_LINE_NEUTRAL:
            if (g_EM_ADC_GainNeutralCurrentLevel >= EM_GAIN_NEUTRAL_NUM_LEVEL_MAX - 1)    /* Is highest gain? */
            {
                return; /* Do nothing */
            }
            else    /* Still exist higher gain */
            {
                g_EM_ADC_GainNeutralCurrentLevel++; /* Increase level count */
                EM_ADC_GainNeutralSet();            /* Apply gain */
            }
            break;
        default:
            break;
    }

}

/******************************************************************************
* Function Name    : void EM_ADC_GainDecrease(EM_LINE line)
* Description      : Decrease phase gain 1 level & set the gain level to port
* Arguments        : None
* Functions Called : EM_ADC_GainPhaseSet()
* Return Value     : None
******************************************************************************/
void EM_ADC_GainDecrease(EM_LINE line)
{
    switch (line)
    {
        case EM_LINE_PHASE:
            if (g_EM_ADC_GainPhaseCurrentLevel == 0)    /* Is lowest gain? */
            {
                return; /* Do nothing */
            }
            else    /* Still exist lower gain */
            {
                g_EM_ADC_GainPhaseCurrentLevel--;   /* Decrease level count */
                EM_ADC_GainPhaseSet();              /* Apply gain */
            }
            break;
        case EM_LINE_NEUTRAL:
            if (g_EM_ADC_GainNeutralCurrentLevel == 0)  /* Is lowest gain? */
            {
                return; /* Do nothing */
            }
            else    /* Still exist lower gain */
            {
                g_EM_ADC_GainNeutralCurrentLevel--; /* Decrease level count */
                EM_ADC_GainNeutralSet();            /* Apply gain */
            }
            break;
        default:
            break;
    }
}
    
/******************************************************************************
* Function Name    : uint8_t EM_ADC_GainGetLevel(EM_LINE line)
* Description      : Get the current phase gain level
* Arguments        : None
* Functions Called : None
* Return Value     : None
******************************************************************************/
uint8_t EM_ADC_GainGetLevel(EM_LINE line)
{
    switch (line)
    {
        case EM_LINE_PHASE:
            return g_EM_ADC_GainPhaseCurrentLevel;
        case EM_LINE_NEUTRAL:
            return g_EM_ADC_GainNeutralCurrentLevel;
        default:
            return 0;
    }
}

void EM_ADC_SetGainValue(EM_LINE line, uint8_t gain)
{
    dsad_gain_t dsad_gain = R_DSADC_GetGainEnumValue(gain);

    switch (line)
    {
        case EM_LINE_PHASE:
            R_DSADC_SetChannelGain(EM_ADC_DRIVER_CHANNEL_PHASE, dsad_gain);
            break;
        case EM_LINE_NEUTRAL:
            R_DSADC_SetChannelGain(EM_ADC_DRIVER_CHANNEL_NEUTRAL, dsad_gain);
            break;
        default:
            break;
    }
}

/******************************************************************************
* Function Name    : void EM_ADC_SetPhaseCorrection(float32_t degree)
* Description      : Set phase correction between I1 and V
* Arguments        : degree: Phase (in degree) of V based on I1
* Functions Called : TBD
* Return Value     : None
******************************************************************************/
void EM_ADC_SetPhaseCorrection(EM_LINE line, float32_t degree)
{
    degree = (degree < 0.0f) ? -degree : degree;

    switch (line)
    {
        case EM_LINE_PHASE:
            EM_ADC_DriverSetPhaseStep(
                EM_ADC_DRIVER_CHANNEL_PHASE,
                (uint16_t)(degree / EM_ADC_DRIVER_PHASE_SHIFT_STEP)
            );
            break;
        case EM_LINE_NEUTRAL:
            EM_ADC_DriverSetPhaseStep(
                EM_ADC_DRIVER_CHANNEL_NEUTRAL,
                (uint16_t)(degree / EM_ADC_DRIVER_PHASE_SHIFT_STEP)
            );
            break;
        default:
            break;

    }
}

